# Merge Seoul metro data
* Mar 27, 2021
* Yejoon Lee

## Read files

In [4]:
import pandas as pd

data_2020 = pd.read_csv(r'C:\Users\IBK\Documents\Seoul_Metro\서울교통공사_역별_일별_시간대별_승하차인원_20201130.csv', encoding='euc-kr')
data_2020.head()

,날짜,호선,역번호,역명,구분,06:00 이전,06:00 ~ 07:00,07:00 ~ 08:00,08:00 ~ 09:00,09:00 ~ 10:00,...,15:00 ~ 16:00,16:00 ~ 17:00,17:00 ~ 18:00,18:00 ~ 19:00,19:00 ~ 20:00,20:00 ~ 21:00,21:00 ~ 22:00,22:00 ~ 23:00,23:00 ~ 24:00,24:00 이후
0,2020-01-01,1호선,150,서울역,승차,356,280,313,774,923,...,2972,3194,3342,3002,2857,2311,2523,1830,987,25
1,2020-01-01,1호선,150,서울역,하차,235,952,828,1043,1694,...,2286,2354,2261,1922,1696,1620,1181,768,426,77
2,2020-01-01,1호선,151,시청,승차,105,118,123,206,318,...,873,1019,1234,1383,1271,1061,991,572,217,2
3,2020-01-01,1호선,151,시청,하차,81,223,334,570,611,...,885,783,849,602,435,293,273,174,149,26
4,2020-01-01,1호선,152,종각,승차,798,366,198,236,310,...,1636,1748,1890,1879,1827,1955,1800,1259,406,6

In [5]:
col_to_del_2020 = ['호선']

In [6]:
data_2019 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2019년 1월_12월 역별 시간대별 승하차인원.xlsx', header=1)
data_2019.head()

,날짜,호선,역번호,역명,구분,06시 이전,06 ~ 07,07 ~ 08,08 ~ 09,09 ~ 10,...,16 ~ 17,17 ~ 18,18 ~ 19,19 ~ 20,20 ~ 21,21 ~ 22,22 ~ 23,23 ~ 24,24시 이후,합 계
0,2019-01-01,1호선,150,서울역,승차,348,321,348,741,940,...,3226,3447,3277,2898,2590,3004,2234,970,38,39559
1,2019-01-01,1호선,150,서울역,하차,222,821,808,961,1472,...,2491,2572,2060,1991,1683,1217,764,456,149,31279
2,2019-01-01,1호선,151,시청,승차,87,98,143,206,280,...,958,1062,1146,1119,992,904,570,211,6,11836
3,2019-01-01,1호선,151,시청,하차,48,237,323,571,577,...,733,746,606,374,311,268,177,144,57,10359
4,2019-01-01,1호선,152,종각,승차,669,318,217,203,333,...,1870,2129,2024,1806,1796,1780,1296,497,31,21042

In [7]:
col_to_del_2019 = ['호선','합 계']

In [8]:
data_2018 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\서울교통공사_관할역별_일별_시간대별_이용인원_20181231.xlsx', header=1)
data_2018.head()

,날짜,구분,호선,역번호,역명,구분.1,05 ~ 06,06 ~ 07,07 ~ 08,08 ~ 09,...,16 ~ 17,17 ~ 18,18 ~ 19,19 ~ 20,20 ~ 21,21 ~ 22,22 ~ 23,23 ~ 24,00 ~ 01,합 계
0,2018-01-01,휴,1호선,150,서울역,승차,373,318,365,785,...,3476,3891,3227,2945,2382,3070,1750,781,96,40393
1,2018-01-01,휴,1호선,150,서울역,하차,205,1040,872,984,...,2885,2845,2337,2131,1669,1404,868,477,147,34730
2,2018-01-01,휴,1호선,151,시청,승차,87,105,124,197,...,1027,1102,1278,1163,1032,975,553,214,9,12298
3,2018-01-01,휴,1호선,151,시청,하차,47,294,497,1017,...,781,702,552,388,308,236,160,100,39,10945
4,2018-01-01,휴,1호선,152,종각,승차,604,399,191,250,...,2127,2172,2171,1873,1935,2084,1458,580,28,22621

In [9]:
col_to_del_2018 = ['구분','호선','합 계']

In [10]:
data_2017_1 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2017년 일별 역별 시간대별 승하차인원(1-8호선)_1-5월.xlsx', header=0)
data_2017_1.head()

,날짜,월,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2017-01-01,1,150,서울역(150),승차,470,286,397,786,1421,...,3178,3610,3858,3376,3384,2537,3914,2660,917,112
1,2017-01-01,1,150,서울역(150),하차,278,880,859,964,1407,...,2682,2743,3074,2492,2120,1798,1618,962,551,179
2,2017-01-01,1,151,시청(151),승차,204,105,112,162,288,...,727,921,955,1043,885,805,730,556,188,5
3,2017-01-01,1,151,시청(151),하차,73,203,314,483,669,...,629,523,483,392,287,257,189,157,122,32
4,2017-01-01,1,152,종각(152),승차,791,390,245,270,323,...,1533,1857,2032,1982,1796,1688,1724,1349,523,20

In [11]:
col_to_del_2017_1 = ['월']

In [12]:
data_2017_2 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2017년 일별 역별 시간대별 승하차인원(1-8호선)_6-12월.xlsx', header=None, names=data_2017_1.columns)
data_2017_2.head()

,날짜,월,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2017-06-01,6,150,서울역(150),승차,381,579,1624,2619,1955,...,3147,3468,4813,8959,4840,3403,3570,2208,1151,156
1,2017-06-01,6,150,서울역(150),하차,273,2023,4819,10126,5726,...,2385,2498,2738,3454,2422,1654,1504,1320,797,317
2,2017-06-01,6,151,시청(151),승차,75,153,287,397,452,...,1459,1656,2338,5845,2859,2291,2407,1634,635,58
3,2017-06-01,6,151,시청(151),하차,177,923,3561,8231,3377,...,827,700,928,1108,643,277,262,226,131,36
4,2017-06-01,6,152,종각(152),승차,132,177,386,571,615,...,2508,2693,4311,9880,5271,4221,5067,4063,1935,180

In [13]:
col_to_del_2017_2 = ['월']

In [14]:
data_2016 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2016년 일별 역별 시간대별 승하차인원(1_8호선).xlsx', sheet_name=2)
data_2016.head()

,날짜,월,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2016-01-01,1,150,서울역(150),승차,469,339,584,1144,1723,...,3639,3554,3200,3076,2519,2281,2398,2056,996,58
1,2016-01-01,1,150,서울역(150),하차,342,1637,1753,1856,2438,...,3341,3108,2656,2134,1859,1394,1344,1056,612,222
2,2016-01-01,1,151,시청(151),승차,103,127,110,191,298,...,1069,1339,1458,1499,1383,1284,1198,675,375,9
3,2016-01-01,1,151,시청(151),하차,68,306,554,939,689,...,1033,1035,951,792,618,402,309,192,114,34
4,2016-01-01,1,152,종각(152),승차,702,341,234,296,335,...,1772,2175,2580,2627,2302,2315,2365,2140,1117,51

In [15]:
col_to_del_2016 = ['월']

In [16]:
data_2015 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2015년 일별 역별 시간대별 승하차인원(1_8호선).xlsx', sheet_name=1)
data_2015.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2015-01-01,150,서울역(150),승차,441,399,572,1106,1474,2020,...,4036,4030,3666,3738,3091,2749,3247,2437,1279,73
1,2015-01-01,151,시청(151),승차,101,95,104,127,233,308,...,1038,1027,1176,1133,850,950,612,497,192,6
2,2015-01-01,152,종각(152),승차,898,482,281,291,328,449,...,1530,2012,2176,2047,1767,1834,1825,1666,736,37
3,2015-01-01,153,종로3가(153),승차,371,212,155,189,347,491,...,1537,1791,1954,1526,1297,1149,1257,953,415,15
4,2015-01-01,154,종로5가(154),승차,57,101,83,128,209,323,...,915,984,948,962,722,576,431,241,102,3

In [17]:
data_2014 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2014년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2014.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2014-01-01,150,서울역(150),승차,543,512,601,1099,1617,1941,...,4179,3633,3212,2667,3279,2720,2820,2122,1000,91
1,2014-01-01,150,서울역(150),하차,466,1231,1073,1280,1516,1738,...,2718,3013,3033,2849,2274,2139,1743,1289,620,172
2,2014-01-01,151,시청(151),승차,144,134,99,161,253,251,...,1087,1266,1266,1398,1081,1182,986,512,131,8
3,2014-01-01,151,시청(151),하차,39,231,226,463,576,585,...,1143,699,628,451,304,264,201,160,87,38
4,2014-01-01,152,종각(152),승차,890,448,261,286,314,471,...,1963,2620,2687,2646,2091,2185,2182,1699,676,28

In [18]:
data_2013 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2013년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2013.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2013-01-01,150,서울역(150),승차,417,484,549,1058,1455,2288,...,4490,4979,4298,4395,3803,3660,4081,2511,2061,67
1,2013-01-01,150,서울역(150),하차,385,1143,1170,1435,1949,2027,...,3347,3182,3149,3131,2473,2458,1920,1293,675,165
2,2013-01-01,151,시청(151),승차,96,109,104,140,189,238,...,915,1137,1247,1288,891,925,891,505,204,14
3,2013-01-01,151,시청(151),하차,34,222,245,422,492,555,...,920,721,483,421,265,250,204,137,68,67
4,2013-01-01,152,종각(152),승차,1016,651,327,338,349,385,...,1593,2051,2383,2315,2157,2513,2228,1953,795,28

In [19]:
data_2012 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2012년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2012.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2012-01-01,150,서울역(150),승차,381,457,572,919,1630,2082,...,4209,4775,3840,4184,3985,3371,3475,3662,1518,112
1,2012-01-01,150,서울역(150),하차,262,972,868,1104,1673,1818,...,3275,3363,3273,3112,2500,2088,1761,1280,699,154
2,2012-01-01,151,시청(151),승차,91,80,111,157,228,261,...,877,896,993,1095,776,691,668,399,127,3
3,2012-01-01,151,시청(151),하차,45,174,213,430,447,651,...,703,558,424,316,260,181,150,95,94,39
4,2012-01-01,152,종각(152),승차,1181,684,252,290,315,424,...,1881,2110,2383,2439,1864,1793,1966,1693,673,9

In [20]:
data_2011 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2011년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2011.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2011-01-01,150,서울역(150),승차,459,458,593,1054,1771,2359,...,3895,3698,3822,3685,3257,3167,2811,2615,1048,41
1,2011-01-01,150,서울역(150),하차,283,1354,1581,1786,2408,2430,...,2806,2571,2614,1974,1875,1594,1368,1500,697,216
2,2011-01-01,151,시청(151),승차,91,85,97,179,273,195,...,990,996,1090,1154,863,891,884,490,168,6
3,2011-01-01,151,시청(151),하차,37,168,269,351,393,512,...,981,805,663,441,323,225,218,154,82,49
4,2011-01-01,152,종각(152),승차,931,654,287,323,332,438,...,1628,2117,2518,2388,2010,2236,2630,2442,1275,28

In [21]:
data_2010 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2010년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2010.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2010-01-01,150,서울역(150),승차,390,400,452,1008,1326,1688,...,2365,2794,2961,2463,2831,2070,2224,1716,804,18
1,2010-01-01,150,서울역(150),하차,187,1169,1171,1715,1984,2396,...,2260,2015,1924,1898,1360,1147,1171,932,548,216
2,2010-01-01,151,시청(151),승차,114,106,144,160,218,194,...,808,822,871,965,853,839,812,594,176,0
3,2010-01-01,151,시청(151),하차,40,197,229,359,368,328,...,863,662,641,643,472,318,250,155,121,13
4,2010-01-01,152,종각(152),승차,917,714,364,304,306,365,...,1547,1851,2210,2243,2210,2090,2575,2583,1207,22

In [22]:
data_2009 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2009년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2009.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2009-01-01,150,서울역(150),승차,303,362,372,756,1064,1424,...,2137,2566,2938,2719,2526,2364,2847,1937,767,152
1,2009-01-01,150,서울역(150),하차,150,888,754,1130,1484,1458,...,1780,1888,1919,1780,1510,1236,1057,856,449,487
2,2009-01-01,151,시청(151),승차,119,130,110,201,218,229,...,887,1153,1009,1089,849,805,797,462,172,594
3,2009-01-01,151,시청(151),하차,37,181,225,367,364,434,...,817,787,686,599,393,295,243,126,71,93
4,2009-01-01,152,종각(152),승차,1167,874,394,361,322,369,...,1512,2053,2192,2325,2136,2359,2613,2176,814,2143

In [23]:
data_2008 = pd.read_excel(r'C:\Users\IBK\Documents\Seoul_Metro\2008년 일별 역별 시간대별 승하차인원(1_8호선).xlsx')
data_2008.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2008-01-01,150,서울역(150),승차,379,287,371,876,965,1389,...,2520,3078,3495,3055,2952,2726,3307,2584,1059,264
1,2008-01-01,150,서울역(150),하차,145,707,689,1037,1170,1376,...,1955,2304,2203,2128,1747,1593,1078,744,406,558
2,2008-01-01,151,시청(151),승차,131,131,101,152,191,202,...,892,900,1154,1706,1444,1267,928,531,233,974
3,2008-01-01,151,시청(151),하차,35,158,203,393,375,460,...,1157,1153,1303,1190,830,454,284,141,107,185
4,2008-01-01,152,종각(152),승차,1287,867,400,330,345,338,...,1867,2269,2777,2834,2646,2784,2920,2290,802,1559

## Unify the columns

In [24]:
data_list = [data_2008,data_2009,data_2010,data_2011,data_2012,data_2013,data_2014,data_2015,data_2016,data_2017_1,data_2017_2,data_2018,data_2019,data_2020]

### Number of columns

In [25]:
data_2020.drop(col_to_del_2020,axis=1,inplace=True)
data_2019.drop(col_to_del_2019,axis=1,inplace=True)
data_2018.drop(col_to_del_2018,axis=1,inplace=True)
data_2017_2.drop(col_to_del_2017_2,axis=1,inplace=True)
data_2017_1.drop(col_to_del_2017_1,axis=1,inplace=True)
data_2016.drop(col_to_del_2016,axis=1,inplace=True)

### Name of columns

In [26]:
for data in data_list:
    data.columns = data_2008.columns

## Concat data

In [27]:
data_total = pd.concat(data_list, axis=0, ignore_index=True)
data_total.shape

(2559276, 24)

In [29]:
import pickle
with open('data_total.pkl', 'wb') as file:
    pickle.dump(data_total, file)

In [35]:
with open(r'C:\Users\IBK\Documents\Seoul_Metro\data_total.pkl', 'rb') as file:
    k = pickle.load(file)

In [ ]:
k.shape

In [40]:
k.head()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
0,2008-01-01,150,서울역(150),승차,379,287,371,876,965,1389,...,2520,3078,3495,3055,2952,2726,3307,2584,1059,264
1,2008-01-01,150,서울역(150),하차,145,707,689,1037,1170,1376,...,1955,2304,2203,2128,1747,1593,1078,744,406,558
2,2008-01-01,151,시청(151),승차,131,131,101,152,191,202,...,892,900,1154,1706,1444,1267,928,531,233,974
3,2008-01-01,151,시청(151),하차,35,158,203,393,375,460,...,1157,1153,1303,1190,830,454,284,141,107,185
4,2008-01-01,152,종각(152),승차,1287,867,400,330,345,338,...,1867,2269,2777,2834,2646,2784,2920,2290,802,1559

In [37]:
k.tail()

,날짜,역번호,역명,구분,05~06,06~07,07~08,08~09,09~10,10~11,...,15~16,16~17,17~18,18~19,19~20,20~21,21~22,22~23,23~24,24~
2559271,2020-11-30,2825,신흥,하차,32,113,97,243,186,155,...,273,297,375,594,440,250,270,139,79,0
2559272,2020-11-30,2826,수진,승차,153,235,624,811,376,255,...,222,305,252,247,124,98,86,48,26,0
2559273,2020-11-30,2826,수진,하차,20,84,127,291,196,185,...,260,289,347,571,494,267,242,160,90,0
2559274,2020-11-30,2827,모란,승차,61,120,342,440,232,189,...,262,284,281,330,186,121,118,56,12,0
2559275,2020-11-30,2827,모란,하차,23,94,146,275,143,154,...,168,173,201,258,192,78,87,70,24,3